REGION_resource.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>WooW-II: Workshop on open Workflows</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="WooW-II: Workshop on open Workflows"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-06-24T16:14+0200"/>
<meta name="author" content="Daniel Arribas-Bel, Thomas de Graaff"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">WooW-II: Workshop on open Workflows</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">

<p>As in most social sciences, virtually no training is provided in regional science on workflow design and choice of appropriate tools, especially not from the viewpoint of <i>open science</i>. Students and young researchers typically receive no guidance as to why or how they should adopt habits that favor the open science principles in their research activity. This is unfortunate, because learning and adopting new tools and workflows require a large time investment, which will only pay-off in the long run. The best time to do this is early in the career when one still has (some) time available. Therefore, this workshop is specifically aimed at young researchers and covers the main ideas behind a well-designed workflow with openness, transparency and reproducibility in mind, and provides an introductory, hands-on, overview of a set of free tools that have been designed with such values in mind.<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>
</p>
<p>
We do not get into every detail of each tool. Instead, we aim to give a gentle introduction, to provide further material and to place them in the appropriate context. Specific emphasis will be put on how certain tools contribute to building a coherent open workflow and how they relate to other tools. The main areas we will review are: mark-up languages such as <code>Markdown</code>, reference managers, particularly those open and free such as <code>Bibtex</code> which are compatible with \LaTeX \, conversion tools such as <code>Pandoc</code>, open environments for statistical computing such as <code>R</code> or <code>Python</code>, version control systems such as <code>Git</code> and back-up solutions on open repositories such as <code>GitHhub</code>. At the end of the workshop, participants should be able to reproduce a paper of their own and make it available in an open form applying the concepts and tools introduced.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Description of the resource</h2>
<div class="outline-text-2" id="text-2">

<p>The structure of the workshop is organized in two main blocks. The first session introduces basic concepts such as open science, transparency and reproducibility. Here, we stress the relevance of paying attention to the way science is carried out and connect it to the choice of tools that allow such values to be seamlessly embraced in the day-to-day practice of quantitative research in social science. The second, longer, part of the workshop includes four sessions with hands-on overviews of specific tools that have been designed with open science principles in mind and that hence provide the ingredients of a well-thought open workflow. This is delivered alternating presentation time with demo time, allowing participants to get a real taste of what using the tools implies and experience their advantages. 
</p>
<p>
The five sessions are presented as follows:
</p><ol>
<li>In this 3h. session we introduce the concepts of workflow, openness and reproducability. In the first part, We argue why they are important and what as social scientists we can learn from data scientists. Our main argument is that, even though in the social sciences complete reproducability is often infeasible, we should strive for research to become <i>as reproducable</i> as possible.
</li>
<li>In this 2h. session we introduce the concepts of version control and automation of tasks. The first relates to keeping track of changes as they occur throughout the proccess, while the second one allows us to break up the different components of an analysis and have them automatically run, when needed, in the correct sequence. The two tools with which we will play to explore these ideas practically are <code>git</code> and <code>make</code>.  
</li>
<li>In this 2h. session we introduce the concept of markup languages and working with the terminal. In particular we focus on <code>Markdown</code>: a very lightweight markup language (and probably the fastest way to create slides). In particular we deal with <code>RStudio</code> and <code>Markdown</code>. This enables writing a (part of a) paper in <code>Markdown</code> in <code>RStudio</code> including headers, links, formula's, tables and references. Using <code>RStudio</code> this allows as well for exporting to more well-known formats , such as <code>docx</code>, <code>html</code> and <code>pdf</code>.
</li>
<li>In this 3h. session we take an overview of the main ideas behind making data analysis reproducible and transparent. We use the <code>R</code> statistical platform in combination with <code>RStudio</code> for two main reasons: (<i>i</i>) it works the best <b>out of the box</b> for <i>our</i> purposes and (<i>ii</i>) at the moment most researchers probably work with this combination for reproducability (at least it gets the biggest buzz&hellip;).
</li>
<li>In this final 1.5h session we introduce how one could make your reproducable research open. This basically means making use of repositories such as <code>Github</code>, which not only serves as a backup repository, but as well as a way of collaboration with known and unknown authors. Further, we show that making slides in <code>RStudio</code> is a breeze and why you actually might want to publish a document in <code>HTML</code> instead on paper.
</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Resource links</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>Website: <a href="http://darribas.org/WooWii/">http://darribas.org/WooWii/</a>
</li>
<li>Materials: <a href="https://github.com/darribas/WooWii">https://github.com/darribas/WooWii</a>
</li>
</ul>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> The creation workshop is generously sponsored by the European Union's Seventh Framework Programme "Foster".
</p></div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-06-24T16:14+0200</p>
<p class="author">Author: Daniel Arribas-Bel, Thomas de Graaff</p>
<p class="email"><a href="mailto:d.arribas-bel@bham.ac.uk">d.arribas-bel@bham.ac.uk</a>, <a href="mailto:t.de.graaff@vu.nl">t.de.graaff@vu.nl</a></p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
