REGION_resource.tex
% Created 2015-06-24 Wed 16:14
\documentclass[scrartcl,a4paper,utopia,10pt]{article}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{microtype, fullpage}
\providecommand{\alert}[1]{\textbf{#1}}

\title{WooW-II: Workshop on open Workflows}
\author{Daniel Arribas-Bel, Thomas de Graaff\thanks{d.arribas-bel@bham.ac.uk,t.de.graaff@vu.nl}}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

This resource describes WooW-II, a two-day workshop on open workflows for
quantitative social scientists. The workshop is broken down in five main
parts, where each part typically consists of an introductionary tutorial and a
hands-on assignment. The specific tools discussed in this workshop are
\texttt{Markdown}, \texttt{Pandoc}, \texttt{Git}, \texttt{Github}, \texttt{R},
and \texttt{Rstudio}, but the theoretical approach applies to a wider range of
tools (including \LaTeX \, and \texttt{Python}). At the end of the workshop,
participants should be able to reproduce a paper of their own and make it
available in an open form applying the concepts and tools introduced.

\section{Background}
\label{sec-1}

As in most social sciences, virtually no training is provided in regional
science on workflow design and choice of appropriate tools, especially not
from the viewpoint of \emph{open science}. Students and young researchers
typically receive no guidance as to why or how they should adopt habits that
favor the open science principles in their research activity. This is
unfortunate, because learning and adopting new tools and workflows require a
large time investment, which will only pay-off in the long run. The best time
to do this is early in the career when one still has (some) time available.
Therefore, this workshop is specifically aimed at young researchers and covers
the main ideas behind a well-designed workflow with openness, transparency and
reproducibility in mind, and provides an introductory, hands-on, overview of a
set of free tools that have been designed with such values in
mind.\footnote{The creation workshop is generously sponsored by the European
Union's Seventh Framework Programme ``Foster''.
 }

We do not get into every detail of each tool. Instead, we aim to give a gentle
introduction, to provide further material and to place them in the appropriate
context. Specific emphasis will be put on how certain tools contribute to
building a coherent open workflow and how they relate to other tools. The main
areas we will review are: mark-up languages such as \texttt{Markdown},
reference managers, particularly those open and free such as \texttt{Bibtex}
which are compatible with \LaTeX \, conversion tools such as \texttt{Pandoc},
open environments for statistical computing such as \texttt{R} or
\texttt{Python}, version control systems such as \texttt{Git} and back-up
solutions on open repositories such as \texttt{GitHhub}. At the end of the
workshop, participants should be able to reproduce a paper of their own and
make it available in an open form applying the concepts and tools introduced.
\section{Description of the resource}
\label{sec-2}

The structure of the workshop is organized in two main blocks. The first
session introduces basic concepts such as open science, transparency and
reproducibility. Here, we stress the relevance of paying attention to the way
science is carried out and connect it to the choice of tools that allow such
values to be seamlessly embraced in the day-to-day practice of quantitative
research in social science. The second, longer, part of the workshop includes
four sessions with hands-on overviews of specific tools that have been
designed with open science principles in mind and that hence provide the
ingredients of a well-thought open workflow. This is delivered alternating
presentation time with demo time, allowing participants to get a real taste of
what using the tools implies and experience their advantages. 

The five sessions are presented as follows:
\begin{enumerate}
\item In this 3h. session we introduce the concepts of workflow, openness and
    reproducability. In the first part, We argue why they are important and
    what as social scientists we can learn from data scientists. Our main
    argument is that, even though in the social sciences complete
    reproducability is often infeasible, we should strive for research to
    become \emph{as reproducable} as possible.
\item In this 2h. session we introduce the concepts of version control and
    automation of tasks. The first relates to keeping track of changes as they
    occur throughout the proccess, while the second one allows us to break up
    the different components of an analysis and have them automatically run,
    when needed, in the correct sequence. The two tools with which we will
    play to explore these ideas practically are \texttt{git} and
    \texttt{make}.
\item In this 2h. session we introduce the concept of markup languages and
    working with the terminal. In particular we focus on \texttt{Markdown}: a
    very lightweight markup language (and probably the fastest way to create
    slides). In particular we deal with \texttt{RStudio} and
    \texttt{Markdown}. This enables writing a (part of a) paper in
    \texttt{Markdown} in \texttt{RStudio} including headers, links, formula's,
    tables and references. Using \texttt{RStudio} this allows as well for
    exporting to more well-known formats , such as \texttt{docx},
    \texttt{html} and \texttt{pdf}.
\item In this 3h. session we take an overview of the main ideas behind making
    data analysis reproducible and transparent. We use the \texttt{R}
    statistical platform in combination with \texttt{RStudio} for two main
    reasons: (\emph{i}) it works the best \textbf{out of the box} for
    \emph{our} purposes and (\emph{ii}) at the moment most researchers
    probably work with this combination for reproducability (at least it gets
    the biggest buzz\ldots{}).
\item In this final 1.5h session we introduce how one could make your
    reproducable research open. This basically means making use of
    repositories such as \texttt{Github}, which not only serves as a backup
    repository, but as well as a way of collaboration with known and unknown
    authors. Further, we show that making slides in \texttt{RStudio} is a
    breeze and why you actually might want to publish a document in
    \texttt{HTML} instead on paper.
\end{enumerate}
\section{Resource links}
\label{sec-3}

\begin{itemize}
\item Website: \href{http://darribas.org/WooWii/}{http://darribas.org/WooWii/}
\item Materials: \href{https://github.com/darribas/WooWii}{https://github.com/darribas/WooWii}
\end{itemize}

\end{document}
